app/controllers/app_noticias_controller.rb

  def index

        if session[:user_id]
              @user=User.find(session[:user_id])
              if @user
                    @profile_id = @user.profile_id
              end
        end
  	@noticias = Contenido.find_noticias_del_perfil(@profile_id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `app_profiles` WHERE (profile_id = 2)

  def new

        @contenido = Contenido.buscar_ultimo_tmp(session[:user_id])

        if @contenido.nil?
           # Creo un nuevo contenido en estado borrador para que comience la edición del mismo
                @contenido = Contenido.new()
                @contenido.estado = Contenido::ESTADO_TMP
                logger.debug("Aplicacion elegida:  #{App.find(:all)[0]}")
                @contenido.app_id = App.find(:all)[0]

                hoy = Date::today()

                @contenido.fecha = hoy
                @contenido.tipo_id = TipoContenido.find(:all)[0]

                @contenido.creador = session[:user_id]

                # Salvando nuevo contenido
                @contenido.save!
---
SELECT * FROM `func_apps` WHERE (app_id = 1)
SELECT * FROM `contenidos` WHERE ( creador = 2 and estado = 0 ) ORDER BY fecha desc LIMIT 1
INSERT INTO `contenidos` (`fecha_inicio`, `fecha_fin`, `created_at`, `updated_at`, `descripcion`, `fecha_creado`, `app_id`, `rotacion`, `tipo_id`, `creador`, `auditor`, `fecha_auditado`, `estado`, `fecha`) VALUES(NULL, NULL, '2010-11-24 19:12:15', '2010-11-24 19:12:15', NULL, NULL, 1, NULL, 1, NULL, NULL, NULL, 0, '2010-11-24')

  def edit

        # Se obtienen el contenido por el id indicado
        @contenido = Contenido.find(params[:contenido][:id])

        # Se obtienen los elementos asociados al contenido
        @elementos = Elemento.find(:all, :conditions => "contenido_id = #{@contenido.id}")

        # Se cargan todos los profiles asociados al contenido actual
        @contenidos_profiles = ContenidoProfile.find(:all, :conditions => "contenido_id = #{params[:contenido][:id]}")
---
SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 1)
SELECT * FROM `elementos` WHERE (contenido_id = 1)
SELECT * FROM `app_profiles` WHERE (profile_id = 2)
SELECT * FROM `contenido_profiles` WHERE (contenido_id = 1)
SELECT * FROM `profiles` WHERE (`profiles`.`id` = 2) LIMIT 1

  def save_contenido

    uri = session[:original_uri]

    logger.debug("La uri original es: #{uri}")

    Contenido.transaction do

      contenido_id = params[:contenido][:id]

      if(!contenido_id.empty?)

             logger.debug(" Salvando contenido existente id: #{params[:contenido][:id]}")
            @contenido = Contenido.find(params[:contenido][:id])

       # Cargando nuevos valores
            @contenido.id = params[:contenido][:id]
            @contenido.tipo_id = params[:contenido][:template_id]
            @contenido.descripcion = params[:contenido][:descripcion]
            @contenido.rotacion = params[:contenido][:rotacion]
            @contenido.fecha = params[:contenido][:fecha_ingreso]
            @contenido.app_id = params[:contenido][:app_id]

            if @contenido.update_attributes(params[:contenido])
---
SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 9)
UPDATE `contenidos` SET `updated_at` = '2010-11-04 19:04:11', `tipo_id` = 4 WHERE `id` = 9

            @contenido = Contenido.new(params[:contenido])

            # Salvando nuevo contenido
            @contenido.save!
---
INSERT INTO `contenidos` (`fecha_inicio`, `fecha_fin`, `created_at`, `updated_at`, `descripcion`, `app_id`, `rotacion`, `tipo_id`, `fecha`) VALUES(NULL, NULL, '2010-11-04 19:34:41', '2010-11-04 19:34:41', '', 1, NULL, 1, NULL)

  def mostrar_formato_template

    logger.debug("Arrancó el mostrar_formato_template")
    begin
        # obtengo el tipo de template a partir del id pasado
        @tipo_template = TipoContenido.find(params[:id])
---
SELECT * FROM `tipo_contenidos` WHERE (`tipo_contenidos`.`id` = 6)