app/controllers/app_profiles_controller.rb

  def index
    @app_profiles = AppProfile.all
---
SELECT * FROM `app_profiles` WHERE (profile_id = 2)