app/controllers/contenidos_controller.rb

SELECT * FROM `contenidos`
---
  def index
    @contenidos = Contenido.all

SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 31)
DELETE FROM `contenidos` WHERE `id` = 31
---
  def destroy
    @contenido = Contenido.find(params[:id])
    @contenido.destroy