app/controllers/func_apps_controller.rb

SELECT * FROM `func_apps`
---
  def index
    @func_apps = FuncApp.all