app/controllers/tipo_contenidos_controller.rb

SELECT * FROM `tipo_contenidos`
---
  def index
    @tipo_contenidos = TipoContenido.all

SELECT * FROM `tipo_contenidos` WHERE (`tipo_contenidos`.`id` = 3)
---
  def show
    @tipo_contenido = TipoContenido.find(params[:id])

SELECT * FROM `tipo_contenidos` WHERE (`tipo_contenidos`.`id` = 3)
---
  def edit
    @tipo_contenido = TipoContenido.find(params[:id])

SELECT * FROM `tipo_contenidos` WHERE (`tipo_contenidos`.`id` = 3)
UPDATE `tipo_contenidos` SET `updated_at` = '2010-11-05 14:29:51', `template` = 'template_noticias_2' WHERE `id` = 3
---
  def update
    @tipo_contenido = TipoContenido.find(params[:id])

    respond_to do |format|
      if @tipo_contenido.update_attributes(params[:tipo_contenido])